# ToRoom Property (Phase) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..ToRoom Property (Phase)
FamilyInstance Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Room this[
	Phase phase
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ToRoom ( _
	phase As Phase _
) As Room
	Get
```

Visual C++
---
```text
public:
property Room^ ToRoom[Phase^ phase] {
	Room^ get (Phase^ phase);
}
```

# ### Parameters
phase
    Type: Autodesk.Revit.DB..::..Phase
# See Also
FamilyInstance Class
ToRoom Overload
Autodesk.Revit.DB Namespace